CellularDetonation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

dl               5.9984e-6;
L                #calc "1000*$dl";
l                #calc "150*$dl";
n                #calc "10*$dl";

vertices
(
    (0 0 0)
    ($L 0 0)
    ($L $l 0)
    (0 $l 0)
    (0 0 $n)
    ($L 0 $n)
    ($L $l $n)
    (0 $l $n)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 150 1) simpleGrading (1 1 1)
); // dx = half reaction length

edges
(
);

boundary
(
    Left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    Right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    TopBottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (5 6 7 4)
            (0 3 2 1)
        );
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
