CellularDetonation/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver          ode;
}

chemistry       on;

initialChemicalTimeStep 1e-12;

odeCoeffs
{
    solver          seulex;
    absTol          1e-8;
    relTol          1e-3;
}

reactions
{
    OneStepRxn
    {
        type     irreversibleArrhenius;
        reaction "R = P";
        A        1.10e9;
        beta     0;
        Ta       6000;
    }
}
// ************************************************************************* //
