CellularDetonation/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   adaptiveFvMesh;
loadBalance
{
    balance false;
}
errorEstimator  densityGradient;

// When can unrefinement start
// beginUnrefine 0.01;

// How often to refine
refineInterval  5;

// Refine field in between lower..upper
lowerRefineLevel 1.0;

// If value < unrefineLevel unrefine
unrefineLevel   0.3;

// Have slower than 2:1 refinement
nBufferLayers   2;

// Refine cells only up to maxRefinement levels
maxRefinement   3;

// Write the refinement level as a volScalarField
dumpLevel       true;
// ************************************************************************* //
