CellularDetonation/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 5e6; // to be overwritten 

boundaryField
{
    Left
    {
		type 	zeroGradient;
    }
    Right
    {
        type zeroGradient;
    }
    TopBottom
    {
        type zeroGradient;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
