CellularDetonation/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      HLLC;

ddtSchemes
{
    default         Euler;
    timeIntegrator  RK3SSP;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(((rho*nuEff)*dev2(T(grad(U)))))      Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho) quadraticMUSCL vanLeer;
    reconstruct(U)  quadraticMUSCL vanLeer;
    reconstruct(e)  quadraticMUSCL vanLeer;
    reconstruct(p)  quadraticMUSCL vanLeer;
    reconstruct(speedOfSound)  quadraticMUSCL vanLeer;
    reconstruct(Yi)  quadraticMUSCL vanLeer;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
