CellularDetonation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    "(e|U)"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.0;
    }
    "Yi.*"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.0;
    }
}


// ************************************************************************* //
